{
	"dorak[iy]":
	{
		"Name": "Doraki Instant Walljump",

		"Description":
		[
			"Walljumping is performed by touching a wall, and then tapping away from it. However, it is also possible to wall jump directly from the ledge.",
			"This technique is called the Ledge Walljump (or Doraki) and is performed as such.",
			"1. Grab the ledge",
			"2. Drop from the ledge",
			"3. Double jump back to the ledge, making sure that you rub up against the wall as you do so.",
			"4. While hanging from the ledge, tap away.",
			"(Credits to /u/ djloreddit)"
		],

		"Links":
		{
			"GIF": "http://i.imgur.com/QxxmkgL.gifc",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=Ut-D3c4HfIg"
		}
	},

	"wavedash(ing)?":
	{
		"Name": "Wavedash",

		"Description":
		[
			"A Wavedash is a technique that is performed by air dodging diagonally into the ground, causing the character to slide a short distance. It allows players to perform any ground action while moving horizontally on the ground."
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/c/c6/Wavedashbig.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=_EcPgWGiEhk",
			"Wiki": "http://www.ssbwiki.com/wavedash"
		}
	},

	"(jc|jumpcanceled)grab":
	{
		"Name": "Jump-Canceled Grab",

		"Description":
		[
			"A jump-canceled grab is a technique where a character interrupts a dash or run with a jump, which itself is then jump-canceled with a grab during the jumpsquat animation. This results in the character using their standing grab while maintaining some momentum from their dash, the amount of which is based on their current speed and traction."
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/9/93/Jump-canceled_Grab_Mario_Melee.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=ffUQu-lYanE",
			"Wiki": "https://www.ssbwiki.com/Jump-canceled_grab"
		}
	},

	"waveshin(e|ing)":
	{
		"Name": "Waveshine",

		"Description":
		[
			"A wavedash can be performed anytime a character is on the ground and can jump. The shine can be canceled by jumping shortly after it is initiated. Therefore, it is possible for Fox and Falco to jump out of a shine into a wavedash.",
			"This advanced technique is known as a waveshine and can be performed as such",
			"1. Shine",
			"2. Jump",
			"3. Airdodge into the stage"
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/File:Fox_Waveshine.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=RnGe7Xur1L8",
			"Wiki": "http://www.ssbwiki.com/Waveshine"
		}
	},

	"lcancel(ing)?":
	{
		"Name": "L-canceling",

		"Description":
		[
			"L-canceling (an abbreviation of lag canceling or  is a technique that allows characters to act faster than usual when landing in the middle of an aerial attack.",
			"To perform an L-cancel, a shield button (L, R, or Z) needs to be pressed 7 frames before landing during an aerial attack"
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/9/94/Lcancelink.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=WNuYq7_nwzY",
			"Wiki": "https://www.ssbwiki.com/L-canceling"
		}
	},

	"dashdanc(e|ing)":
	{
		"Name": "Dash-Dancing",

		"Description":
		[
			"Dash-dancing is one of the most used techniques in Melee. While being one of the easiest to perform, it's one of the hardest to master. Dash-dancing is used to play spacing mindgames with the opponent, and to make openings that can punished.",
			"Performed by rapidly tapping the analog stick left and right while on the ground, it cancels out the character's initial dashing animation with another animation in the opposite direction, causing the character to quickly and repeatedly dash to the right and left in a short distance."
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/b/ba/Dashdance.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=vG3hIEI-oAk",
			"Wiki": "http://www.ssbwiki.com/Dash-dance"
		}
	},

	"di(rectionalinfluence)?":
	{
		"Name": "Directional Influence",

		"Description":
		[
			"Directional influence, abbreviated DI, is the control the receiver of an attack has over his or her trajectory. DI can be used to alter, but not completely change, the original trajectory the player was sent at by an attack.",
			"This change can be vital to surviving high-power attacks such as Fox's up smash, and for escaping combos such as Jigglypuff's up-throw to rest combo on fast-fallers."
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/7/71/DI-Melee.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=XdTLRNTABpw",
			"Wiki": "http://www.ssbwiki.com/Directional_influence"
		}
	},

	"neutral(game)?":
	{
		"Name": "Neutral Game",

		"Description":
		[
			"The neutral game, or just neutral, is a phase during gameplay when no player has a situational advantage over the other. In this phase, either player's objective is to win the neutral game, i.e. land a hit with possible follow-ups, or punish the enemy for a failed attempt to do so."
		],

		"Links":
		{
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=MCPC202uwR4",
			"Wiki": "http://www.ssbwiki.com/Neutral_game"
		}
	},

	"scarjump":
	{
		"Name": "Scar Jump",

		"Description":
		[
			"The Scar Jump is a variant of the Wall Jump in which a character wall jumps *without* using their midair jump from the ledge or stage."
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/8/84/Scar_Jump.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=-C1sTQdVSRA",
			"Wiki": "https://www.ssbwiki.com/Scar_Jump"
		}
	},

	"(s|smash)di":
	{
		"Name": "Smash DI",

		"Description":
		[
			"Smash directional influence is a mechanic that allows players to slightly alter their position during the freeze frames of being hit by an attack. Tapping the control stick in any direction during freeze frames will slightly move their character in that direction, allowing them to potentially escape multi-hit moves or certain combos"
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/9/99/SDI_Snake_Brawl.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=CO7YD9KqNhY",
			"Wiki": "http://www.ssbwiki.com/Smash_directional_influence"
		}
	},

	"(cc|crouchcancel)(ing)?":
	{
		"Name": "Crouch Canceling",

		"Description":
		[
			"A crouch cancel (or CC) is a technique in the Super Smash Bros. series used to reduce the effect of an attack on the user. By crouching before getting hit by an attack, some aspect of the attack will be weakened."
		],

		"Links":
		{
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=72aidPrzScA",
			"Wiki": "https://www.ssbwiki.com/Crouch_cancel"
		}
	},

	"moonwalk(ing)?":
	{
		"Name": "Moonwalking",

		"Description":
		[
			"In Super Smash Bros. Melee, the moonwalk is a technique that involves sliding backwards during in the initial dash animation",
			"Moonwalking is achieved by tilting the control stick backwards while dashing, but without passing through the neutral position. The only easy way to do this is to rotate the stick below the neutral position (as going above results in a jump), but just barely below as to prevent losing some distance from crouching."
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/b/b1/Moonwalking_Melee.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=D_xDJM3jOYg",
			"Wiki": "https://www.ssbwiki.com/Moonwalk"
		}
	},

	"shinostall(ing)?":
	{
		"Name": "Shino Stalling",

		"Description":
		[
			"The Shino stall grants the user total invincibility. This technique takes advantage of the invincibility caused by grabbing a ledge along with the invincibility caused by Sheik's Vanish move.",
			"1. Grab a ledge",
			"2. Press away from the stage to let go",
			"3. The moment you are in the air, input up-b and then hold down ",
			"4. Continue holding down until the pink explosion, at which point press nothing",
			"5. You will then grab the ledge, and 7 frames later you can let go and repeat.",
			"(Credits to /u/ djloreddit)"
		],

		"Links":
		{
			"GIF": "http://imgur.com/iabwbxq",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=K3DI4Zl6b1E"
		}
	},

	"shielddrop(ping)?":
	{
		"Name": "Shield Dropping",

		"Description":
		[
			"Shield platform dropping is an advanced technique in all four Super Smash Bros. games. It involves dropping through a soft platform while shielding by tilting the analog stick down."
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/5/58/Brawl-ShieldPlatformDrop.gif",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=_IQFgGm49aI",
			"Wiki": "http://www.ssbwiki.com/Shield_platform_dropping"
		}
	},

	"marthkiller":
	{
		"Name": "Marth Killer",

		"Description":
		[
			"The Marth Killer is a technique in Super Smash Bros. Melee that can be used to edge-hog a recovering Marth.",
			"It involves using the light shield on the edge of the stage, facing towards the center, and is most easily performed by rolling towards the ledge, holding Z, and pointing the shield downwards."
		],

		"Links":
		{
			"GIF": "http://imgur.com/6WrHuTl",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=XmlM3qkdva4",
			"Wiki": "http://supersmashbros.wikia.com/wiki/Marth_Killer"
		}
	},

	"tech(ing)?":
	{
		"Name": "Teching",

		"Description":
		[
			"Teching allows the player to get back up after hitting a surface (such as a wall or floor) instead of lying on the ground until using a get-up action. This technique is great for survival as it can be used to survive combos, or walljump off the stage (wall-teching)",
			"To perform, the player must press the shield button 20 frames before hitting the surface, but if pressed too early, the player can't tech again for another 40 frames."
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/8/8b/SSB4_Mega_Man_Tech.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=P-ASMMMdiO4",
			"Wiki": "https://www.ssbwiki.com/Tech"
		}
	},

	"ecawk":
	{
		"Name": "Edge-canceled Aerial Wizard Kicks",

		"Description":
		[
			"An EcAWK is a technique in Project M for Ganondorf which allows for comboing, edgeguarding, and most importantly **STYLEEE**",
			"To perform an EcAWK, aerial wizard kick onto a ledge and, if you're close enough, you'll slide off the ledge and cancel all the lag you would have experienced from landing on the ground."
		],

		"Links":
		{
			"Source": "https://smashboards.com/threads/ganon-strategies-and-gameplay-discussion.347166/page-6#post-16997998"
		}
	},

	"haxdash(ing)?":
	{
		"Name": "Haxdash",

		"Description":
		[
			"A haxdash is a waveland done from the ledge, to the ledge again. It is often used to mix up opponents or bait them. It is mostly performed with Captain Falcon but can also be done by Marth, Fox, and Falco on specific stages"
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/c/cd/CF_Ledgedashstall_no_ff_17ms_with_input_display.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=lxg05IN9ncw"
		}
	},

	"multishin(e|ing)":
	{
		"Name": "Multishine",

		"Description":
		[
			"A multishine is a technique which involves shining (Fox and Falco's down-b) multiple times. This moves is often used for shield pressure but is an extremely difficult technique to pull of consistently.",
			"A multishine is performed by jump-cancelling a shine and using another shine right after leaving the ground. If timed correctly this can be chained into multiple shines very quickly."
		],

		"Links":
		{
			"GIF": "https://www.ssbwiki.com/images/d/d6/MultiShine.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=EAMoJ8ZpvjE",
			"Wiki": "https://www.ssbwiki.com/Double_shine"
		}
	},

	"thunderscombo":
	{
		"Name": "Thunder's Combo",

		"Description":
		[
			"At it's core, Thunder's combo consists of wavedashing out of the Shine in order to Jab Reset the opponent. However, more attacks (such as drill or falling uair) can be added to the beginning and end of this combo to make it truly devastating.",
			"This combo only works on characters who fall to the ground after being Shined(Falco, Fox, Kirby, YL, Pichu, Pikachu, Jigglypuff, Mewtwo, GW, and Roy). For it to work on the rest of the cast a waveshine must be performed.",
			"(Credits to /u/ djloreddit)"
		],

		"Links":
		{
			"GIF": "http://imgur.com/fl9Uov4",
			"Source": "https://smashboards.com/threads/thunders-combo-udated-again-9-27-06.81139/"
		}
	},

	"pcdrop":
	{
		"Name": "PC Drop",

		"Description":
		[
			"A PC drop is a ledge-grab mixup technique not often used but extremely useful. It is performed by fast walking to the ledge and turning around right before approaching the ledge. Every character in the cast can do this"
		],

		"Links":
		{
			"Video tutorial": "https://www.youtube.com/watch?v=yw9pfO9UORU"
		}
	},

	"samistall(ing)?":
	{
		"Name": "Samistalling",

		"Description":
		[
			"A samistall is a stalling method that shiek can use at the ledge in which she is completely invicible.",
			"Samistalling is performed by letting go of ledge and using up-b back to it at an angle to regrab it."
		],

		"Links":
		{
			"GIF": "https://gfycat.com/ThisEachBellfrog",
			"SSBM Tutorials Video": "https://www.youtube.com/watch?v=01GZwcJfI_o"
		}
	},

	"gentlem(en|an)":
	{
		"Name": "Gentleman",

		"Description":
		[
			"The Gentleman is a nickname that refers to the third hit of Captain Falcon's standing neutral attack combo, when it is not followed by rapid punches. It inflicts a great deal of knockback.",
			"There are several methods to perform the Gentleman. The player can perform the third neutral attack input by pressing any button in conjunction with the neutral attack. S2J discovered that one can hold down on the control stick after the initial jab and continue the rest of the combo to do the Gentleman."
		],

		"Links":
		{
			"GIF": "https://i.imgur.com/ZLvhNj5.jpg",
			"Video Tutorial": "https://www.youtube.com/watch?v=atcUA-lH4Bs",
			"Wiki": "http://www.ssbwiki.com/Gentleman"
		}
	},

	"jabreset(ting)?":
	{
		"Name": "Jab Reset",

		"Description":
		[
			"A jab reset is a technique in that is performed by jabbing an opponent while they are knocked down.It results with the opponent being forced to get up automatically. The player can then follow up with any move they desire, which is usually utilised to land a KO Move.",
			"It should be noted that this can also be performed with weak moves such as Fox's drill."
		],

		"Links":
		{
			"GIF": "http://www.ssbwiki.com/images/0/09/Jabreset.gif",
			"Video Tutorial": "https://www.youtube.com/watch?v=cy2q1Q_vg8w",
			"Wiki": "http://www.ssbwiki.com/jab_reset"
		}
	},

	"waveland(ing)?":
	{
		"Name": "Wavelanding",

		"Description":
		[
			"A waveland is very similar to a wavedash in that with both the player airdodges towards the stage to move with their airdodge momentum. A waveland is different in that it is performed while falling down and not initatied from a jump like a wavedash."
		],

		"Links":
		{
			"Video Tutorial": "https://www.youtube.com/watch?v=bgefBARNmbw"
		}
	},

	"dustscoot(ing)?":
	{
		"Name": "",

		"Description":
		[
			"!wavedash"
		],

		"Links":
		{
			"":""
		}
	},

	"funcancel(ing)?":
	{
		"Name": "",

		"Description":
		[
			"!lcancel"
		],

		"Links":
		{
			"":""
		}
	},

	"20xx":
	{
		"Name": "",

		"Description":
		[
			"The year is **20XX**. Everyone plays Fox at TAS levels of perfection. Because of this, the winner of a match depends solely on port priority. The RPS metagame has evolved to ridiculous levels due to it being the only remaining factor to decide matches."	
		],

		"Links":
		{
			"":""
		}
	},

	"jigglypuff":
	{
		"Name": "",

		"Description":
		[
			"[Hey there](https://www.youtube.com/watch?v=wHn3FL9Drps)"
		],

		"Links":
		{
			"":""
		}
	},

	"ics":
	{
		"Name": "",

		"Description":
		[
			"[:c](https://youtu.be/1v2Nz9-iJ6g?t=71)"
		],

		"Links":
		{
			"":""
		}
	}
}